[
{"asin_number": "B06Y34RQ6Y", "review_id": "R19ZJACRA8XBW5", "user_name": "MN", "user_link": "amazon.in/gp/profile/amzn1.account.AEF7WL7QS5CYKDH6AX6I4RQ6ZJPA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "1.0", "review_title": "Worthless product", "date": "3 April 2018", "verified_purchase": "Verified Purchase", "review": "Hate this. Bought in mid march, went kaput on Apr 3rd . 15 days straight. Amazon's product return window closed a week back so amazon wouldn;t return it. Total waste of money and time. Amazon customer care says: contact HP service center. Now I don't wish to make rounds of HP service center for a 600 rs mouse, hence throwing it in the dustbin and getting a logitech wireless mouse. Royal waste. Don't buy. I did not mandhandle it. I repeat... the device went kaput without any warning.", "helpful_count": 94},
{"asin_number": "B06Y34RQ6Y", "review_id": "R3RX7T2P5TEHM5", "user_name": "Shivansh Goel", "user_link": "amazon.in/gp/profile/amzn1.account.AFID3PQHA62KCPJVFU6ERRPKLRYA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "3.0", "review_title": "Overall the mouse is very good the only problem is that when you shutdown the ...", "date": "14 January 2018", "verified_purchase": "Verified Purchase", "review": "Overall the mouse is very good the only problem is that when you shutdown the computer/laptop the mouse doesn't shuts automatically and thus you have to do it manually by a small button given at its lower side but the button is so delicate that it can be ruined easily. So my advice is that if you want to use it ruf and tuff or if you have kids to use this mouse then PLEASE DONT BUY IT except go for a wired one.", "helpful_count": 57},
{"asin_number": "B06Y34RQ6Y", "review_id": "R2D8G7AMMTT1WG", "user_name": "vicky anand", "user_link": "amazon.in/gp/profile/amzn1.account.AFUU3J4UOXYRDRAIQ6FTZM7EVLUQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "4.0", "review_title": "not suited for people who prefer a large mouse or have a huge hand like I do", "date": "6 October 2017", "verified_purchase": "Verified Purchase", "review": "warning - very small. not suited for people who prefer a large mouse or have a huge hand like I do. (see pictures) I will have to do away with it. rest, the product works flawlessly. the on/off button is a good feature and saves battery.", "helpful_count": 126},
{"asin_number": "B06Y34RQ6Y", "review_id": "R38F5N8J6V6WB6", "user_name": "Nitin", "user_link": "amazon.in/gp/profile/amzn1.account.AHBKXTL2OFZIEB22UEOUH44ZXXFQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "2.0", "review_title": "Battery guzzling mouse", "date": "12 June 2020", "verified_purchase": "Verified Purchase", "review": "Many years ago, I had visited a local computer shop, looking for an inexpensive wireless mouse. Owner told me, you might prefer a cheap, Chinese mouse, but it will drain the battery so fast, that you might regret your decision. I am reminded of that incident, when I started using this mouse. I went for this mouse, since it's an HP product and I expected quality. For the record, the mouse is smooth and works fine. But in the 4+ months that I used it, I changed the batteries (2 AAA sized batteries) at least twice. This particular mouse really consumes the batteries so fast, users will get frustrated. Imagine having to replace the 2 nos. AAA size batteries (total cost Rs 30) every 2 months. So effectively the additional cost is Rs 150-180 a year for the batteries alone! I earlier had a Logitech mouse, which DID NOT eat up the battery so fast. And incidentally, the Logitech mouse worked with one AA sized battery, so overall additional cost was far lesser. Very disappointed with this HP mouse, and unlikely to buy any model of HP wireless mouse again. Key lessons: 1. Look up user reviews about how long batteries last in the mouse 2. Preferably go for a mouse which requires only 1 AA sized battery. Hope readers find this review useful.", "helpful_count": 4},
{"asin_number": "B06Y34RQ6Y", "review_id": "R3E2EDN0VIKSUJ", "user_name": "Aman", "user_link": "amazon.in/gp/profile/amzn1.account.AFVZJRDXJ3WCBBNHGLZK7ZPWRADQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "2.0", "review_title": "poor quailty by hp", "date": "18 August 2019", "verified_purchase": "Verified Purchase", "review": "don't buy this product as it button is to small for on d off. it is can break anytime. the mouse quailty of material is very poor. being hp brand the comprise on the build quailty for this mouse. biggest drawback when off the computer you also have to press off button if forgot it doesnt go for sleep automatically. battery will drain quickly. in my logitech if you forgot to switch off it goes to auto sleep. as whole it is not good buy except small size which is good thing only otherwise it just poor quailty product.", "helpful_count": 4},
{"asin_number": "B06Y34RQ6Y", "review_id": "R2YBBDU0NOVXAA", "user_name": "sagar", "user_link": "amazon.in/gp/profile/amzn1.account.AHVNIAXJYHQJGEJDCODU77UIXWEA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "1.0", "review_title": "unresponsive and cursor moves automaticaly", "date": "31 May 2020", "verified_purchase": "Verified Purchase", "review": "Amazon Delivered it quite fast in 1 day , even in lock-down , thats why I choose to give it 1 more chance by getting different unit of same mouse , but unsure it will work , mouse was wireless it did connect without any problem but it did NOT WORK AT ALL , as cursor was not responsive and it was moving diagonally downwards , previously i thought its some bug or drive problem even after checking from device manager everything was good and hp pc hardware diagnostic tool , problem was not fixed . look and feel is good but i do not know how it will work and whats precision with pages scroll, click and selection precision. will update with replacement device .", "helpful_count": 4},
{"asin_number": "B06Y34RQ6Y", "review_id": "R219G17UGG3YDB", "user_name": "Sanket Deshpande", "user_link": "amazon.in/gp/profile/amzn1.account.AHCNB3S3UGPZ5WYDBLVA3NVGJZ7Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "4.0", "review_title": "Decent Product for the Price", "date": "21 November 2019", "verified_purchase": "Verified Purchase", "review": "A good mouse for the price. However this may not be ideal for someone who has big hands and also for people who are not used to holding and using a small mouse. The pros of this mouse is its build quality which is pretty good for this price. It is also comfortable to hold due to its design. However it's small size might be it's biggest con as it takes around 4-5 days to get used to it for someone who is used to using a big mouse", "helpful_count": 3},
{"asin_number": "B06Y34RQ6Y", "review_id": "RRUOTSIAAHN7R", "user_name": "Manish Gupta", "user_link": "amazon.in/gp/profile/amzn1.account.AFSAX2CIHOJZOTMPI7ZQLXLXDLFA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "5.0", "review_title": "Can be made ones with more sturdy dongles please", "date": "25 February 2018", "verified_purchase": "Verified Purchase", "review": "Good one. However, the dongle is puny. The problem I've been having with the puny ones is that they're not very sturdy. I always carry these on my laptop. They go in and out of my bag a couple of times a day, attached to my laptop. Eventually, every 2-3 months the dongle breaks or rather the glue holding the pieces together comes off. Since the dongle is puny and the contact surface very small, it's impossible to glue the pieces back together again. That results in me having to buy a new wireless mouse, every 2-3 months. I wish they would make larger dongles like they used to.", "helpful_count": 4},
{"asin_number": "B06Y34RQ6Y", "review_id": "R3NPD1D2TD7Y5A", "user_name": "Rudradev Mitra", "user_link": "amazon.in/gp/profile/amzn1.account.AFH2HSDASNQ6PSWU2SQN6S3K5EKQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "3.0", "review_title": "Product is about average", "date": "24 February 2021", "verified_purchase": "Verified Purchase", "review": "Product is average compare to price. Black colour is dull. No auto power saving. So you have to turn off the mouse power switch which is verry small to operate. Mouse click are little tight. Just bought so not sure how much long it will last. Packaging look like little old & dirty. Product package on September 2020. So old packaging. Not sure original or not. But seems like working. Hence think it original. Lets hope for the best. Spend 715rs. Mouse dont have DPI button. Run on dual aaa battery. Battery chamber top also very thin plastic so have to be careful or it will broken. Product is avarage quality plastic. Not expected from hp. Buy Logitech better function & quality you will get in this price.", "helpful_count": 0},
{"asin_number": "B06Y34RQ6Y", "review_id": "R3TPJ36XA0RXP7", "user_name": "Pratik Sinha", "user_link": "amazon.in/gp/profile/amzn1.account.AGYVSZ4DQUP557CCKOA2DTXA4XRQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "3.0", "review_title": "Good mouse but not the best.", "date": "13 March 2020", "verified_purchase": "Verified Purchase", "review": "I am writing this review after 1.5 years of use and I must say the mouse was working very good for 9 months and then the scroll was behaiving wierd and did not scroll fast, was scrolling slow. Later I sold it off. Pros: Good to hold Good response Less maintainance. Cons: Uses Optical Light which consumes more battery. Battery has to be replaced every 3-4 months. So after 1-2 years the battery cost will be more than mouse. Scroll wheel stopped working after an year.", "helpful_count": 1}
]