[
{"asin_number": "B09CGLJBPY", "review_id": "R2EZ49L043AM7M", "user_name": "Sonia gemini", "user_link": "amazon.in/gp/profile/amzn1.account.AFJ4H4CNEKLQUBQ3B22PO5NDZIEA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "1.0", "review_title": "Buying this is a gamble.", "date": "17 October 2021", "verified_purchase": "Verified Purchase", "review": "The latest iteration from Jabra looked promising. But boy did it disappoint me. The main issue with these earphones are the prominent hissing sound (white noise) it produces almost all the time. Even if you play music at high volumes, you can hear a hiss in the background and it is really annoying. I thought it was the issue with my pair and got them replaced. But the new pair had the same issue too. So it is an issue with almost all pairs. It is sad because other than that these earphones have a lot of potential. The sound quality is bang on with rich bass that is not muddy. The mids and highs were warm and clear. The build is not the best especially in case of the case (ಠﭛಠ), the lid is wiggly and feels cheap. The fit was good and secure but felt like you entered a vaccum chamber. Overall a solid pair but completely destroyed because of one single major issue.", "helpful_count": 91},
{"asin_number": "B09CGLJBPY", "review_id": "R2OAWOWJO0X2Q1", "user_name": "Anurag I", "user_link": "amazon.in/gp/profile/amzn1.account.AEPCGNAFC5IZS2GPAVUZ27TBK3LA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "5.0", "review_title": "Really good one", "date": "15 October 2021", "verified_purchase": "Verified Purchase", "review": "I must say, I am impressed by the quality and sound of the tws, didn't expect them to be good for this price, I do already have a Samsung galaxy buds+, compared to that this one does have a better sound quality and jabra's fit a bit better than Samsung, but to be fair I wish we had a better EQ setting for the jabra other than that the missing features do make up for the sound quality considering Samsung doesn't support aptx and also Samsung doesn't have a good water resistance rating, IPX2 VS IP55. Overall if we take every point and compare it with the other buds in this price range, I am not sure others offer a better value for the price, considering the sound and product quality and by the way some people expect the product to be something else for what the price they are, please don't do that, reviews based on the expectations quotient are really annoying.", "helpful_count": 24},
{"asin_number": "B09CGLJBPY", "review_id": "RA7CL2FDM63ON", "user_name": "Allen Viegas", "user_link": "amazon.in/gp/profile/amzn1.account.AFRNRCQ5YMCNRHLFRFYBWEO5FDKA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "4.0", "review_title": "Its a good product however not great for that price", "date": "16 October 2021", "verified_purchase": "Verified Purchase", "review": "The things I liked: Call quality. Battery life. Fit. Things promised but not delivered: Noise isolation. Super bass. Interactive app. Considering the name and price I expected more except the call quality The music experience is same as any TWS earphones.", "helpful_count": 20},
{"asin_number": "B09CGLJBPY", "review_id": "R2GOAJMA0LKAMQ", "user_name": "Ramesh", "user_link": "amazon.in/gp/profile/amzn1.account.AEO3PEDM2I3W7MKU7MIHBGOOWMGA/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "2.0", "review_title": "Not for iPhone.", "date": "14 October 2021", "verified_purchase": "Verified Purchase", "review": "Do not buy these, if you’re using an iPhone. The equaliser doesn’t work with iOS. Nowhere it is mentioned. Either Amazon or the seller is trying to fool the customers.", "helpful_count": 19},
{"asin_number": "B09CGLJBPY", "review_id": "R1FQL6TLL4RHUK", "user_name": "Tushar G.", "user_link": "amazon.in/gp/profile/amzn1.account.AHJWEMAB2LKHKS75VMPWKXFOBY5Q/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "5.0", "review_title": "CLEAN BASS. GOOD PNC. PERFECT VFM PRODUCT.", "date": "22 October 2021", "verified_purchase": "Verified Purchase", "review": "I am using these for a week now. I'll keep this review simple to answer a general buyers expectations. Audio quality: The music experience when paired with my Samsung Galaxy Tab tuned with AKG, was no less than any ear buds in premium segment. Clear sound, clean bass & perfect milieu of Highs & Mids. Call quality: I use these with my HP laptop too for online meetings and the other side can listen to my voice very clearly even though my apartment is alongside a busy road. Connectivity: Connectivity is brilliant. Can move around my 2 BHK apartment while on call keeping my phone in the middle of the house. No connection drop or distortion unless I cross 2 rooms. Connects instantly as soon as you remove from case. Mono: You can use one bud at a time and make most of the battery time. Though it doesn't support multipoint connection, that is, it can only stay connected to one device at a time. When you want to switch between devices, disconnect from one paired device and connect to the other paired device. But it's quite fast, doesn't take much time to do this. Battery: I use throughout the day for meetings that go as long as 2 hours and not once did it say battery low. Build quality: It's nice and premium plastic matte build. Feels good in ears, goes deeper keeping it properly fitted inside the ears. Soft press buttons so no chance of accidental touches and the button click is very soft, not distracting at all. The case is also plastic build with strong magnetic holders for buds preventing them from accidental fall. I think that sums up the key highlights of this product. It's a perfect definition for Value For Money product. I strongly recommend to go with these if you're looking in this price segment.", "helpful_count": 7},
{"asin_number": "B09CGLJBPY", "review_id": "R27DCKRVCPN5SV", "user_name": "Karthikeyan S", "user_link": "amazon.in/gp/profile/amzn1.account.AHRMCMWV4VI7MNFNWSPDW2QQOJ2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "2.0", "review_title": "Just keep away from this elite 3", "date": "29 October 2021", "verified_purchase": "Verified Purchase", "review": "Elite 3 is jabra budget earbud. So you need to compare with other earphones in the 3k price range. So keep in mind before thinking of other pros. It has 4 mics as per spec, the call quality is good for other hearing you speaking. Not for you, I am still figuring oout how good the side tone works. It really confuses me while in call sounds like some one is speaking to me while I am speaking, better not enable it. It should be  priced at 3k. Beware the online portal comes with Hindi only manual. Rest who do not know Hindi decide what to do with this..", "helpful_count": 6},
{"asin_number": "B09CGLJBPY", "review_id": "R3UOD6EUKNUV6S", "user_name": "mayank", "user_link": "amazon.in/gp/profile/amzn1.account.AEJOPN2FMEFJLVAXWV4DFZA6DJLQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "1.0", "review_title": "Good design and ok sound but lack of features at this price.", "date": "6 November 2021", "verified_purchase": "Verified Purchase", "review": "Good looking and ok sound quality. However, crucial functions are lacking, which is not acceptable at this price. 1) No two devices can be connected at the same time; even the Jabra 65t has this feature. 2) When removing the earbuds from the ear, there is no automatic stop and play. Again Jabra 65t has this feature. 3) The Jabra mobile application does not provide individual earbud battery percentages. 4) No battery percentage of the earbuds case available on Jabra app. 5) There is a white/pink noise when in the idle position, which is not pleasant. The battery backup is adequate.", "helpful_count": 6},
{"asin_number": "B09CGLJBPY", "review_id": "R2Z4UFCF47XM2C", "user_name": "Sargana", "user_link": "amazon.in/gp/profile/amzn1.account.AGQUWTMRAIWGJUPTRIVAYG76A56A/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "3.0", "review_title": "The software component  is worthless", "date": "2 December 2021", "verified_purchase": "Verified Purchase", "review": "Heres the thing - jabra can provide all things in one go but they power down their hardware by software. E.g the app doesn’t capture last location. Presets went missing. No voice prompts (really jabra really!). Mono mode is great but again they took away native teams mute (which is there on elite active 65t and 75t but they dont have mono mode but master slave pairing which is prehistoric). Basically in absence of any real innovation they are creating multiple products by reducing price point and software features. Nothing else. Heard 7 pro are exceptionally horrible so hoping they fire their pricing analyst>Unlock software downgrades by ota updates> increase price. But is jabra listening", "helpful_count": 4},
{"asin_number": "B09CGLJBPY", "review_id": "R1XLE271NSYNJS", "user_name": "Abhay Phadnis", "user_link": "amazon.in/gp/profile/amzn1.account.AEO2QKHLS5ZUHD5ZZRB2B36DAJQQ/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "2.0", "review_title": "Works well - when it works!", "date": "3 December 2021", "verified_purchase": "Verified Purchase", "review": "The first pair I received had ridiculously liw sound even at full volume. Amazon replaced it very quickly. The second pair was louder, but still not what I expected. With that limitation, the sound was very good. Within 3 weeks, however, the right earbud went dead. It doesn't get charged at all and doesn't respond to any of the troubleshooting steps suggested by Jabra (and I tried every last one of them!) Since it was now beyond Amazon's replacement window, I reached out to the Jabra customer support phone number. I was told to send an email with the details of the problem and proof of purchase, and that someone would respond in 24-48 hours. I sent the email and nothing happened. When I called Jabra again, I was told to wait for 72 hours. No response beyond that. In the meantime, the mono mode allows me to use the left earbud - hardly enough consolation for a new product going bust!", "helpful_count": 4},
{"asin_number": "B09CGLJBPY", "review_id": "R23CUDOS9XW86A", "user_name": "Samarth", "user_link": "amazon.in/gp/profile/amzn1.account.AEEKPVBZWVAGKH67NEOXFEGCZP2A/ref=cm_cr_arp_d_gw_btm?ie=UTF8", "rating": "4.0", "review_title": "Almost the best product at a very decent rate!", "date": "12 November 2021", "verified_purchase": "Verified Purchase", "review": "Elite 3 are the best fitting TWS earphones that I have used. They are super light! Your ears wont feel tired, aching even after 3-4 hrs of continuous use. Audio quality is top notch! Bass is fine, treble is good.. Good audio quality overall It has Noise isolation which works well. Had it be having ANC, these would have been the best earphones! Isolation is good, you can hear the background sounds but at very low level.. button press and HearThrough is enabled and you can hear everything that you want without the need to take the buds out. Absolutely loved it!", "helpful_count": 3}
]